bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
/**
 * @file hwzc.c
 *
 * @brief Hardware ZC detection via ADC digital comparators + SCCP timers.
 *
 * State machine per commutation step:
 *   BLANKING -> WATCHING -> COMM_PENDING -> commutate -> BLANKING
 *
 * All functions called from priority-7 ISRs (comparator or SCCP1) except
 * HWZC_Init (called from ServiceInit) and HWZC_Enable (called from ADC ISR
 * at the moment of crossover handoff).
 *
 * Binding rules enforced:
 *   Rule 2: Comparator IE disabled before PINSEL changes
 *   Rule 3: hwzc.phase written BEFORE starting SCCP1 timer
 *   Rule 4: Threshold from garudaData.bemf.zcThreshold
 *   Rule 10: Comparator ISR trusts ADnCMPSTAT, no re-read
 *   Rule 13: stepPeriodHR protected by seqlock (writeSeq)
 *
 * Component: HWZC
 */

#include "../garuda_config.h"

#if FEATURE_ADC_CMP_ZC

#include "hwzc.h"
#include "speed_pi.h"
#include "commutation.h"
#include "../garuda_calc_params.h"
#include "../hal/hal_adc.h"
#include "../hal/hal_timer.h"
#if (FEATURE_HWZC_PI_FLOAT && HWZC_PI_FF_ENABLE) || FEATURE_HWZC_ABS_FLOOR
#include "../garuda_foc_params.h"   /* VBUS_SCALE_V_PER_COUNT, focKeUvSRad scaling */
#endif
#include <xc.h>

/**
 * @brief Initialize HWZC state to idle defaults.
 * Called from GARUDA_ServiceInit().
 */
void HWZC_Init(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.phase = HWZC_IDLE;
    pData->hwzc.enabled = false;
    pData->hwzc.enablePending = false;
    pData->hwzc.activeCore = 0;
    pData->hwzc.lastZcStamp = 0;
    pData->hwzc.lastCommStamp = 0;
    pData->hwzc.stepPeriodHR = 0;
    pData->hwzc.writeSeq = 0;
    pData->hwzc.commSeq = 0;
    pData->hwzc.goodZcCount = 0;
    pData->hwzc.missCount = 0;
    pData->hwzc.fallbackPending = false;
    pData->hwzc.firstZcAfterEnable = false;
    pData->hwzc.dbgLatchDisable = false;
    pData->hwzc.stepsSinceLastHwZc = 0;
    pData->hwzc.totalZcCount = 0;
    pData->hwzc.totalMissCount = 0;
    pData->hwzc.totalCommCount = 0;
    pData->hwzc.rejectsThisStep = 0;
#if FEATURE_HWZC_FALLING_OFFWIN
    pData->hwzc.offWinBand = 1;      /* runs start at low duty — OFF window armed */
    pData->hwzc.offWinFalling = 0;
#endif
    pData->hwzc.dbgTimeoutAdcVal = 0;
    pData->hwzc.dbgTimeoutThresh = 0;
    pData->hwzc.dbgTimeoutCmpmod = 0;
    pData->hwzc.dbgTimeoutCmpstat = 0;
    pData->hwzc.dbgTimeoutCore = 0;
    pData->hwzc.dbgTimeoutStep = 0;
    pData->hwzc.dbgTimeoutBemfThresh = 0;
    pData->hwzc.dbgEnableStepPeriod = 0;
    pData->hwzc.dbgAdvanceDeg = 0;
    pData->hwzc.dbgFilterOffset = 0;
#if FEATURE_HWZC_SECTOR_PI
    pData->hwzc.timerPeriod = 0;
    pData->hwzc.integrator = 0;
#if FEATURE_HWZC_PI_FLOAT
    pData->hwzc.integratorF = 0.0f;
#endif
#if FEATURE_HWZC_PI_DEFENSIVE
    pData->hwzc.piDefMissStreak = 0;
    pData->hwzc.piDefGoodStreak = 0;
    pData->hwzc.piDefActive = 0;
    pData->hwzc.piDefEntryCount = 0;
#endif
    pData->hwzc.lastCaptureHR = 0;
    pData->hwzc.prevCommHR = 0;
    pData->hwzc.captureValid = false;
    pData->hwzc.stepPeriodForFilterComp = 0;
    pData->hwzc.dbgPiDelta = 0;
    pData->hwzc.dbgPiCaptureCount = 0;
    pData->hwzc.dbgPiMissCount = 0;
    for (uint8_t s = 0; s < 6; s++) {
        pData->hwzc.dbgPiMissBySector[s] = 0;
        pData->hwzc.dbgPiCapBySector[s] = 0;
    }
#endif
#if FEATURE_BEMF_INTEGRATION
    pData->hwzc.shadowHwzcSkipCount = 0;
    pData->hwzc.obsCommSeq = 0;
    pData->hwzc.obsLastCommTick = 0;
#endif

#if GARUDA_TARGET_AK512
    /* Per-phase comparator handles: disable all three BEMF channels */
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_A);
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_B);
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_C);
#else
    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);
#endif
}

/**
 * @brief Activate hardware ZC detection. Called from ADC ISR at the
 * post-CheckDeadline commutation hook when enablePending && wasZcDeadline.
 * The new step has just been applied by COMMUTATION_AdvanceStep().
 */
void HWZC_Enable(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.enabled = true;
    pData->hwzc.enablePending = false;
    pData->hwzc.goodZcCount = 0;
    pData->hwzc.missCount = 0;
    pData->hwzc.noiseRejectCount = 0;
    pData->hwzc.stepsSinceLastHwZc = 1;  /* First step: IIR valid with seeded lastZcStamp */
    pData->hwzc.firstZcAfterEnable = true; /* Bypass plausibility gate + IIR on 1st ZC */

    /* Seed stepPeriodHR from software ZC step period */
    pData->hwzc.dbgEnableStepPeriod = pData->timing.stepPeriod;
    pData->hwzc.stepPeriodHR = HWZC_ADC_TO_SCCP2(pData->timing.stepPeriod);

    /* Initialize timestamps. Seed lastZcStamp to half a step period before
     * now so the first measured interval (first real ZC - lastZcStamp) is
     * approximately one full step, not half a step. Without this, the first
     * IIR update biases stepPeriodHR low, causing an early commutation. */
    uint32_t now = HAL_SCCP2_ReadTimestamp();
    pData->hwzc.lastZcStamp = now - pData->hwzc.stepPeriodHR / 2;
    pData->hwzc.lastCommStamp = now;

#if FEATURE_HWZC_SECTOR_PI
    /* Sector PI seed: start timerPeriod at the IIR-seeded stepPeriodHR
     * (the same value the reactive path uses for its first commutation
     * scheduling). integrator tracks timerPeriod 1:1. prevCommHR matches
     * lastCommStamp so the first capValue (computed at next PI fire)
     * uses a sensible base. captureValid stays false until first ZC. */
    pData->hwzc.timerPeriod   = pData->hwzc.stepPeriodHR;
    pData->hwzc.integrator    = pData->hwzc.stepPeriodHR;
    pData->hwzc.prevCommHR    = now;
    pData->hwzc.lastCaptureHR = now - pData->hwzc.stepPeriodHR / 2;
    pData->hwzc.captureValid  = false;
    pData->hwzc.stepPeriodForFilterComp = pData->hwzc.stepPeriodHR;
#if FEATURE_HWZC_PI_FLOAT
    /* integratorF = period (same semantics as integer integrator). */
    pData->hwzc.integratorF = (float)pData->hwzc.stepPeriodHR;
  #if HWZC_PI_FF_ENABLE
    /* Phase 2 feedforward as a ONE-SHOT SEED ONLY: if the no-load
     * physics formula predicts a tighter period than the SW handoff
     * value, jump-start the integrator to the physics prediction.
     * Only safe to apply when motor is already moving (duty > 3%)
     * AND the prediction would SLOW the controller (P_ff > stepPeriodHR).
     * Speeding it up at handoff is what stalled the motor on the
     * first FF attempt — don't do that. */
    {
        float dutyFrac = (float)pData->duty / (float)LOOPTIME_TCY;
        float vbus_v   = (float)pData->vbusRaw * VBUS_SCALE_V_PER_COUNT;
        float lambdaPm = (float)gspParams.focKeUvSRad;
        if (dutyFrac > 0.03f && vbus_v > 6.0f && lambdaPm > 0.0f) {
            float P_ff = (181.380f * lambdaPm) / (vbus_v * dutyFrac);
            /* Only adopt FF if it predicts a SLOWER controller
             * (longer period) than the SW handoff. Faster predictions
             * at handoff over-commit the bridge before the rotor has
             * caught up. */
            if (P_ff > pData->hwzc.integratorF)
                pData->hwzc.integratorF = P_ff;
        }
    }
  #endif
#endif
#endif

    /* Enable SCCP1 interrupt (priority already set by ServiceInit).
     * Clear any stale flag first to prevent immediate spurious ISR entry. */
    _CCT1IF = 0;
    _CCT1IE = 1;

    /* Arm hardware for the current (new) step */
    HWZC_OnCommutation(pData);
}

/**
 * @brief Deactivate hardware ZC and request fallback to software ZC.
 * Called from SCCP1 ISR (on miss-limit) or when eRPM drops below crossover.
 * Sets fallbackPending for the ADC ISR to perform the actual re-seed.
 */
void HWZC_Disable(volatile GARUDA_DATA_T *pData)
{
    pData->hwzc.enabled = false;

    /* Stop timer and disable all HW ZC interrupts.
     * Clear _CCT1IF to prevent stale event on next HWZC_Enable(). */
    HAL_SCCP1_Stop();
    _CCT1IE = 0;
    _CCT1IF = 0;
#if GARUDA_TARGET_AK512
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_A);
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_B);
    HAL_ADC_DisableComparatorIE(FLOATING_PHASE_C);
    HAL_ADC_BemfBurstOff();   /* leftover 1 MHz burst starves AD1CH3 ISR */
#else
    HAL_ADC_DisableComparatorIE(1);
    HAL_ADC_DisableComparatorIE(2);
#endif

    pData->hwzc.phase = HWZC_IDLE;
    pData->hwzc.fallbackPending = true;
}

/**
 * @brief HW-ZC blanking ticks = base % of the commutation period, plus an
 * optional load-adaptive demag term (FEATURE_ZC_CURRENT_BLANK).
 *
 * Base = HWZC_BLANKING_PERCENT of @p period (HR ticks). Under load the
 * post-commutation freewheel/demag interval lengthens with PHASE current and
 * masks the BEMF at sector start → the ZC window collapses → desync. The extra
 * term grows the blank with measured PHASE current above a deadband, in RAW ADC
 * counts (gain-independent), capped so total blanking never exceeds period/4.
 * Shared by HWZC_OnCommutation and HWZC_OnBlankingExpired so both stay in sync.
 *
 * NOTE: keyed off PHASE current (max|iaRaw|,|ibRaw| about bias), NOT bus
 * current. The freewheel diode conducts the PHASE current (that's what sets the
 * demag interval), and bench data shows ibusRaw reads BELOW bias under load
 * (freewheel valley-sampling artifact) → a bus-keyed term never engaged during
 * the actual desync. Phase current is the clean, positive, load-tracking signal.
 */
static inline uint32_t HWZC_BlankTicks(volatile GARUDA_DATA_T *pData, uint32_t period)
{
    uint32_t blankTicks = period * HWZC_BLANKING_PERCENT / 100;
#if FEATURE_ZC_CURRENT_BLANK
    /* Duty gate (bench 2026-07-03): at low duty the phase-current raw samples
     * read >120 counts off bias with no real load (valley-sampling artifact),
     * so a current deadband alone cannot keep this term quiet - perA=8 made
     * 6%-duty CL thrash 3k<->7k eRPM until gated. The slam this term targets
     * lives at >=52% duty; reuse zcDemagDutyThresh (%) as the engage floor. */
    uint32_t dutyPct100 = (uint32_t)pData->duty * 100u;
    if (RT_ZC_DEMAG_BLANK_PER_A > 0 &&
        dutyPct100 >= (uint32_t)RT_ZC_DEMAG_DUTY_THRESH * (uint32_t)LOOPTIME_TCY)
    {
        /* iaRaw/ibRaw are in the 2048 bias frame (OC autozero). Use the larger
         * of the two phase magnitudes as the demag driver. */
        int32_t iaDev = (int32_t)pData->phaseCurrent.iaRaw - 2048;
        int32_t ibDev = (int32_t)pData->phaseCurrent.ibRaw - 2048;
        uint32_t iaMag = (uint32_t)(iaDev < 0 ? -iaDev : iaDev);
        uint32_t ibMag = (uint32_t)(ibDev < 0 ? -ibDev : ibDev);
        uint32_t iMag  = (iaMag > ibMag) ? iaMag : ibMag;
        int32_t iExcess = (int32_t)iMag - (int32_t)RT_ZC_DEMAG_BLANK_IBUS_DB;
        if (iExcess > 0)
        {
            /* perA = extra blank (% of sector) per 256 counts of phase excess.
             * Compute the percentage first (clamped) THEN scale by period — at
             * low speed `period` is large (100 MHz HR ticks), so
             * period*perA*excess would overflow uint32. */
            uint32_t pct = (uint32_t)RT_ZC_DEMAG_BLANK_PER_A
                         * (uint32_t)iExcess / 256u;
            if (pct > 100u) pct = 100u;   /* total still capped at period/4 below */
            uint32_t extra = period * pct / 100u;
            blankTicks += extra;
            /* Total blank cap = blankMaxPct% of period. 25 = legacy period/4;
             * raise (33 = period/3) for more headroom when perA saturates above
             * the ~5.7A knee. 0 (unseeded profile) falls back to legacy 25. */
            uint32_t blankMaxPct = RT_ZC_DEMAG_BLANK_MAX_PCT;
            if (blankMaxPct == 0u) blankMaxPct = 25u;
            uint32_t blankMax = period * blankMaxPct / 100u;
            if (blankTicks > blankMax) blankTicks = blankMax;
        }
    }
#endif
    if (blankTicks < 100) blankTicks = 100;  /* Minimum 1us blanking */
    return blankTicks;
}

/**
 * @brief Set up ZC detection for the current commutation step.
 * Configures comparator channel, PINSEL, threshold, and starts blanking timer.
 * Called from SCCP1 ISR after commutation fires, and from HWZC_Enable().
 */
void HWZC_OnCommutation(volatile GARUDA_DATA_T *pData)
{
    uint32_t now = HAL_SCCP2_ReadTimestamp();
#if FEATURE_HWZC_SECTOR_PI
    /* Save previous commutation timestamp before overwriting — capValue is
     * computed as (lastCaptureHR - prevCommHR) at next OnPiPeriodExpired. */
    pData->hwzc.prevCommHR = pData->hwzc.lastCommStamp;
#endif
    pData->hwzc.lastCommStamp = now;
    pData->hwzc.rejectsThisStep = 0;

    /* Determine floating phase and comparator for this step */
    uint8_t step = pData->currentStep;
    uint8_t floatPhase = commutationTable[step].floatingPhase;
    int8_t pol = commutationTable[step].zcPolarity;
    bool risingZc = (pol > 0);

