bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
        for (uint8_t i = 0; i < HWZC_VERIFY_READS; i++) {
            /* Wait one ADC conversion period FIRST so the read sees a fresh
             * sample (not the comparator-trigger sample). 80 NOPs ≈ 800 ns
             * + read/branch ≈ 1 µs total at SCCP3 = 1 MHz. */
            for (uint8_t j = 0; j < 80; j++) __asm__ volatile("nop");

#if GARUDA_TARGET_AK512
            uint16_t adc_now = HAL_ADC_BemfChannelData(v_core);
#else
            uint16_t adc_now = (v_core == 1) ? AD1CH5DATA : AD2CH1DATA;
#endif
            bool crossed = v_rising ? (adc_now > v_thresh) : (adc_now < v_thresh);
            if (!crossed) {
                /* Phantom — BEMF returned to original side within one sample
                 * period. Re-arm comparator, keep timeout running. */
                pData->hwzc.noiseRejectCount++;
                pData->hwzc.rejectsThisStep++;
                HAL_ADC_ClearComparatorFlag(v_core);
                HAL_ADC_EnableComparatorIE(v_core);
                return;
            }
        }
    }
#endif

#if FEATURE_HWZC_SECTOR_PI
    /* Sector PI mode: ZC has passed noise rejection. Just record the
     * timestamp and let the autonomous SCCP1 timer (set in OnBlankingExpired
     * to fire at lastCommStamp + timerPeriod) drive commutation.
     * HWZC_OnPiPeriodExpired will run the PI math using this capture.
     *
     * Comparator IE is disabled — this is the "one accept per sector" rule
     * (matches ATA's ProcessBemfSample one-shot semantic). Further ZC IRQs
     * in this sector would be phantoms or chatter; let them sleep until
     * the next OnBlankingExpired re-enables. */
    pData->hwzc.lastCaptureHR = zcStamp;
    pData->hwzc.captureValid  = true;
    pData->hwzc.lastZcStamp   = zcStamp;   /* keep legacy field for diag */
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;
    HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);
    return;
#endif

    /* Cancel the timeout timer */
    HAL_SCCP1_Stop();

    /* Update stepPeriodHR with seqlock (Rule 13).
     * Guard 1: only update IIR when this ZC follows exactly one commutation
     * (consecutive detection). Multi-step intervals include timeout periods,
     * not real motor periods — they contaminate the estimator.
     * Guard 2: freeze IIR for the first N ZCs after HWZC_Enable. A single
     * phantom or mistimed ZC during morph handoff used to pull stepPeriodHR
     * rapidly toward floor (observed in ~50% of morph attempts). Holding the
     * seeded stepPeriodHR for a few cycles lets the motor lock in at the
     * morph-exit rate before the IIR starts adapting. */
    if (pData->hwzc.stepsSinceLastHwZc == 1
        && pData->hwzc.goodZcCount >= HWZC_IIR_FREEZE_ZC_COUNT)
    {
        pData->hwzc.writeSeq++;  /* odd = write in progress */
        uint32_t newPeriod = (3 * pData->hwzc.stepPeriodHR + interval) / 4;
        if (newPeriod < RT_HWZC_MIN_STEP_TICKS)
            newPeriod = RT_HWZC_MIN_STEP_TICKS;
        pData->hwzc.stepPeriodHR = newPeriod;
        pData->hwzc.writeSeq++;  /* even = stable */
    }
    pData->hwzc.stepsSinceLastHwZc = 0;

    pData->hwzc.lastZcStamp = zcStamp;

    /* Track consecutive good ZCs (saturate to prevent stale re-seed) */
    if (pData->hwzc.goodZcCount < 0xFFFE)
        pData->hwzc.goodZcCount++;
    pData->hwzc.missCount = 0;
    pData->hwzc.totalZcCount++;

    /* Optimization B: use commDelay pre-computed by OnBlankingExpired.
     * Saves ~1.5 µs of division/interpolation inside the latency-critical ISR.
     * The cached value reflects stepPeriodHR at blanking-expiry, which is the
     * same IIR-filtered value used here except for the one IIR update above
     * (25% weight on the just-measured interval — negligible at steady state). */
    uint32_t commDelay = pData->hwzc.cachedCommDelay;
    if (commDelay < 10) commDelay = 10;

    /* Gate comparator OFF during COMM_PENDING. After accepting a real ZC, the
     * BEMF stays on the crossed side until the next commutation — any further
     * comparator IRQs in this window come from PWM ripple oscillating the
     * signal back across threshold, body-diode recovery, or cross-coupling,
     * and waste ~5µs of ISR time each (verify reads + interval check + re-arm)
     * for no useful purpose. At high RPM these spurious ISRs starve the 24kHz
     * ADC ISR, delaying threshold updates and degrading the NEXT sector's
     * detection. Re-enabled in OnBlankingExpired of next step. */
    HAL_ADC_DisableComparatorIE(pData->hwzc.activeCore);

    /* Set state BEFORE starting timer (Rule 3) */
    pData->hwzc.phase = HWZC_COMM_PENDING;

    HAL_SCCP1_StartOneShot(commDelay);
}

/**
 * @brief Commutation deadline reached — advance to next step.
 * Called from SCCP1 ISR when phase == HWZC_COMM_PENDING.
 */
void HWZC_OnCommDeadline(volatile GARUDA_DATA_T *pData)
{
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;  /* 16-bit, atomic for observer (Rule 13) */
    pData->hwzc.stepsSinceLastHwZc++;

    /* Set up ZC detection for the new step */
    HWZC_OnCommutation(pData);
}

#if FEATURE_HWZC_SECTOR_PI
/**
 * @brief Sector PI period expired — run PI math and commutate.
 *
 * Called from SCCP1 ISR (via _CCT1Interrupt) when phase == HWZC_WATCHING
 * AND FEATURE_HWZC_SECTOR_PI=1. In reactive mode this slot is HWZC_OnTimeout
 * (a missed-ZC handler); in PI mode it is the AUTONOMOUS commutation event.
 *
 * Algorithm (ported from PATA6847 sector_pi.c at the 225k milestone):
 *   1. Compute setValue from current advance schedule and timerPeriod.
 *      setValue = (advancePlus30Fp8 × timerPeriod) >> 8
 *      At lock, capValue ≈ setValue. With filter comp already aligning
 *      capValue with the true rotor ZC, the formula assumes:
 *          ZC happens at (advance + 30°)/60° of the inter-commutation
 *          interval, since commutation fires `advance°` early relative
 *          to the next rotor sector boundary.
 *   2. delta = capValue − setValue (signed phase error)
 *   3. delta = clamp(delta, ±timerPeriod >> CLAMP_SHIFT)
 *   4. integrator += delta >> KI_SHIFT
 *   5. timerPeriod = integrator + (delta >> KP_SHIFT)
 *   6. Advance commutation step, re-arm next sector.
 *
 * On capture-miss: skip PI update (timerPeriod unchanged), still commutate.
 * The motor is more robust to a missed sample than to a wrong correction.
 */

void HWZC_OnPiPeriodExpired(volatile GARUDA_DATA_T *pData)
{
    /* Compute current torque-advance (interpolated from RT_TIMING_ADV_MAX_DEG)
     * — same schedule the reactive path uses, just consumed differently. */
    uint16_t advDeg;
    uint32_t T = pData->hwzc.timerPeriod;
#if FEATURE_TIMING_ADVANCE
    uint32_t eRPM = (T > 0) ? HWZC_TICKS_TO_ERPM(T) : 0;
    if (eRPM <= RT_RAMP_TARGET_ERPM)
        advDeg = TIMING_ADVANCE_MIN_DEG;
    else if (eRPM >= RT_TIMING_ADV_FULL_ERPM)
        advDeg = RT_TIMING_ADV_MAX_DEG;
    else {
        uint32_t range = RT_TIMING_ADV_FULL_ERPM - RT_RAMP_TARGET_ERPM;
        uint32_t pos = eRPM - RT_RAMP_TARGET_ERPM;
        advDeg = TIMING_ADVANCE_MIN_DEG +
            (uint16_t)((uint32_t)(RT_TIMING_ADV_MAX_DEG - TIMING_ADVANCE_MIN_DEG)
                       * pos / range);
    }
#else
    advDeg = 0;
#endif
    pData->hwzc.dbgAdvanceDeg = advDeg;

