bhanuprakashjh/ProjectGaruda/dspic33AKESC/motor/hwzc.c
    /* Enter / exit defensive mode (hysteresis: 6 in / 2 out) */
    if (!pData->hwzc.piDefActive &&
        pData->hwzc.piDefMissStreak >= HWZC_PI_DEFENSIVE_TRIGGER) {
        pData->hwzc.piDefActive = 1;
        if (pData->hwzc.piDefEntryCount < 0xFFFFFFFF)
            pData->hwzc.piDefEntryCount++;
    } else if (pData->hwzc.piDefActive &&
               pData->hwzc.piDefGoodStreak >= HWZC_PI_DEFENSIVE_EXIT) {
        pData->hwzc.piDefActive = 0;
    }

    /* While defensive, walk integratorF (and timerPeriod) larger to
     * deliberately slow the bridge so the rotor can catch up. */
    if (pData->hwzc.piDefActive) {
  #if FEATURE_HWZC_PI_FLOAT
        pData->hwzc.integratorF *= (1.0f + (float)HWZC_PI_DEFENSIVE_GROW_PCT * 0.01f);
        pData->hwzc.timerPeriod = (uint32_t)pData->hwzc.integratorF;
        pData->hwzc.integrator  = (uint32_t)pData->hwzc.integratorF;
  #else
        /* Integer-PI fallback: scale by (100 + grow) / 100 */
        uint32_t scaled = (pData->hwzc.integrator
                           * (100UL + HWZC_PI_DEFENSIVE_GROW_PCT)) / 100UL;
        pData->hwzc.integrator  = scaled;
        pData->hwzc.timerPeriod = scaled;
  #endif
        /* Mirror to stepPeriodHR so telemetry stays consistent */
        pData->hwzc.writeSeq++;
        pData->hwzc.stepPeriodHR = pData->hwzc.timerPeriod;
        pData->hwzc.writeSeq++;
    }
#endif /* FEATURE_HWZC_PI_DEFENSIVE */

pi_commutate:
    /* Slow-IIR update of stepPeriodForFilterComp — this is the period used
     * in ω·τ for HWZC_ApplyFilterComp. Decoupled from timerPeriod to break
     * the positive-feedback loop where a single PI period-shrink → larger
     * ω·τ → larger CMPLO offset → earlier comparator fire → more PI shrink.
     *
     * Shift 11 → 1/2048 per sector ≈ 11 ms time constant at 190k eRPM.
     * Slow vs PI per-sector dynamics (~1 ms) → loop gain << 1.
     * Fast vs real motor accel (~50 ms) → tracks real changes adequately. */
    if (pData->hwzc.stepPeriodForFilterComp == 0) {
        pData->hwzc.stepPeriodForFilterComp = pData->hwzc.timerPeriod;
    } else {
        int32_t pDelta = (int32_t)pData->hwzc.timerPeriod
                       - (int32_t)pData->hwzc.stepPeriodForFilterComp;
        pData->hwzc.stepPeriodForFilterComp =
            (uint32_t)((int32_t)pData->hwzc.stepPeriodForFilterComp
                       + (pDelta >> 11));
    }

    /* Advance to next sector — autonomous timer drives this regardless
     * of capture state. OnCommutation re-arms BLANKING + comparator. */
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;
    pData->hwzc.stepsSinceLastHwZc = 0;
    HWZC_OnCommutation(pData);

#if FEATURE_SPEED_PI
    /* Speed PI runs after the timing PI has updated stepPeriodHR.
     * Per-ZC interval-based: this fires every sector (variable rate
     * scaling with rotor speed). No-op until SPEED_PI_Enable() called
     * by CL state entry. */
    SPEED_PI_OnZcEvent(pData);
#endif
#if FEATURE_SPEED_CASCADE
    /* WS4: outer speed PI of the cascade — runs after the timing PI has
     * updated stepPeriodHR; produces the inner loop's current reference.
     * No-op until SPEED_CASCADE_Enable() on CL entry. */
    SPEED_CASCADE_OnZcEvent(pData);
#endif
}
#endif /* FEATURE_HWZC_SECTOR_PI */

/**
 * @brief ZC timeout — no crossing detected within 2x step period.
 * Called from SCCP1 ISR when phase == HWZC_WATCHING.
 * Either forces a step or falls back to software ZC on miss-limit.
 */
void HWZC_OnTimeout(volatile GARUDA_DATA_T *pData)
{
    /* Capture diagnostics: what did the ADC channel actually see? */
    uint8_t core = pData->hwzc.activeCore;
#if GARUDA_TARGET_AK512
    /* Per-phase channels: VA = AD1CH1, VB = AD1CH2, VC = AD2CH2 */
    if (core == FLOATING_PHASE_A)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH1DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH1CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH1CON2bits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH1FLG;
    }
    else if (core == FLOATING_PHASE_B)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH2DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH2CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH2CON2bits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH2FLG;
    }
    else
    {
        pData->hwzc.dbgTimeoutAdcVal = AD2CH2DATA;
        pData->hwzc.dbgTimeoutThresh = AD2CH2CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD2CH2CON2bits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD2CMPSTATbits.CH2FLG;
    }
#else
    if (core == 1)
    {
        pData->hwzc.dbgTimeoutAdcVal = AD1CH5DATA;
        pData->hwzc.dbgTimeoutThresh = AD1CH5CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD1CH5CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD1CMPSTATbits.CH5CMP;
    }
    else
    {
        pData->hwzc.dbgTimeoutAdcVal = AD2CH1DATA;
        pData->hwzc.dbgTimeoutThresh = AD2CH1CMPLO;
        pData->hwzc.dbgTimeoutCmpmod = AD2CH1CONbits.CMPMOD;
        pData->hwzc.dbgTimeoutCmpstat = AD2CMPSTATbits.CH1CMP;
    }
#endif /* GARUDA_TARGET_AK512 */
    pData->hwzc.dbgTimeoutCore = core;
    pData->hwzc.dbgTimeoutStep = pData->currentStep;
    pData->hwzc.dbgTimeoutBemfThresh = pData->bemf.zcThreshold;

    pData->hwzc.missCount++;
    pData->hwzc.totalMissCount++;
    pData->hwzc.stepsSinceLastHwZc++;

    if (pData->hwzc.goodZcCount > 0)
        pData->hwzc.goodZcCount--;

    if (pData->hwzc.missCount >= HWZC_MISS_LIMIT)
    {
        /* Too many misses — fall back to software ZC.
         * Clear goodZcCount to prevent stale synced re-seed.
         * Latch disable to prevent re-enable cycling (preserves diagnostics). */
        pData->hwzc.goodZcCount = 0;
        pData->hwzc.dbgLatchDisable = true;
        HWZC_Disable(pData);
        return;
    }

    /* Forced step: advance commutation and try next step */
    COMMUTATION_AdvanceStep(pData);
    pData->hwzc.totalCommCount++;
    pData->hwzc.commSeq++;

    HWZC_OnCommutation(pData);
}

#if HWZC_USE_SW_COMPARE
/**
 * @brief Software ZC detection on a mid-ON ADC sample.
 * Called from the 24 kHz ADC ISR after bemfRaw is populated. Replaces the
 * 1 MHz hardware digital comparator path — mid-ON sampling avoids the
 * 48 kHz phantom-crossing issue where PWM ripple through the board's
 * 5.5 kHz RC filter constantly crosses the threshold.
 *
 * Runs the exact same accept logic as HWZC_OnZcDetected (plausibility gate,
 * IIR update, commDelay scheduling) minus the HW comparator re-arm. State
 * machine (BLANKING → WATCHING → COMM_PENDING) is identical.
 *
 * No-op unless enabled && phase == HWZC_WATCHING && sample is valid.
 */
void HWZC_OnSoftwareSample(volatile GARUDA_DATA_T *pData)
{
    if (!pData->hwzc.enabled) return;
    if (pData->hwzc.phase != HWZC_WATCHING) return;
    if (!pData->bemf.bemfSampleValid) return;   /* AD2 pin-mux settling */

    uint8_t step = pData->currentStep;
    int8_t  pol = commutationTable[step].zcPolarity;
    bool    risingZc = (pol > 0);

    /* Apply deadband/hysteresis matching the HW comparator path */
    uint16_t thresh = pData->bemf.zcThreshold;
    if (risingZc)
        thresh = (thresh + HWZC_CMP_DEADBAND < 4095) ? thresh + HWZC_CMP_DEADBAND : 4095;
    else
        thresh = (thresh > HWZC_CMP_DEADBAND) ? thresh - HWZC_CMP_DEADBAND : 0;

    uint16_t bemfRaw = pData->bemf.bemfRaw;
    bool crossed = risingZc ? (bemfRaw > thresh) : (bemfRaw < thresh);
    if (!crossed) return;

    uint32_t zcStamp = HAL_SCCP2_ReadTimestamp();

    /* First ZC after HWZC_Enable: bypass plausibility gate + skip IIR.
     * See HWZC_OnZcDetected for rationale. */
    if (pData->hwzc.firstZcAfterEnable) {
        pData->hwzc.firstZcAfterEnable = false;
        HAL_SCCP1_Stop();
        pData->hwzc.lastZcStamp = zcStamp;
        pData->hwzc.stepsSinceLastHwZc = 0;
        if (pData->hwzc.goodZcCount < 0xFFFE)
            pData->hwzc.goodZcCount++;
        pData->hwzc.missCount = 0;
        pData->hwzc.totalZcCount++;

